MultiMote/meshcore-waveshare-esp32-c6-lcd-147/variants/waveshare-esp32-c6-lcd-147/target.h
#pragma once

#define RADIOLIB_STATIC_ONLY 1
#include <RadioLib.h>
#include <WaveshareESP32C6LCDBoard.h>
#include <helpers/radiolib/RadioLibWrappers.h>
#include <helpers/ESP32Board.h>
#include <helpers/radiolib/CustomSX1262Wrapper.h>
#include <helpers/AutoDiscoverRTCClock.h>
#include <helpers/SensorManager.h>
#include <helpers/ui/ST7789Display.h>
#include <helpers/ui/MomentaryButton.h>

extern WaveshareESP32C6LCDBoard board;
extern WRAPPER_CLASS radio_driver;
extern AutoDiscoverRTCClock rtc_clock;
extern SensorManager sensors;

#ifdef DISPLAY_CLASS
    extern DISPLAY_CLASS display;
    extern MomentaryButton user_btn;
#endif


bool radio_init();
uint32_t radio_get_rng_seed();
void radio_set_params(float freq, float bw, uint8_t sf, uint8_t cr);
void radio_set_tx_power(int8_t dbm);
mesh::LocalIdentity radio_new_identity();

